# Wrangling Open Street Map Data
---
[Introduction](#intro)

[Challenges Encountered](#challenge)

[Data Processing/Auditing/Cleaning](#dataClean)

[Dataset Statistics and Items of Interest](#datastats)

[Improvements/Suggestions](#improvements)

---

### Introduction<a name='#intro'></a>

#### Map Area - Henderson, Nevada, United States
![Henderson,NV](Map_Image.png)

### Challenges Encountered <a name="#challenge"></a>
Intro

- Test
- Test
- Test

### Data Processing/Auditing/Cleaning <a name='#dataclean'></a>
intro
- test
- test
- test

### Dataset Statistics/Items of Interest <a name='#datastats'></a>

#### Function to Retrieve Custom SQL Queries and Output as DataFrame Object
This function allows analyst to easily write custom SQL queries and send them directly to our SQLite server. Once retrieved, records are output/displayed as a Pandas DataFrame for easy maniupulation/plotting/and displaying in Jupyter Environment.

In [1]:
import sqlite3 as sq
import os
import pandas as pd
import re
#Home
#filepath = r'S:\Code\School\WGU_DataAnalyst_NanoDegree\02 - Data Wrangling with MongoDB'

#Work
filepath = r'C:\Users\p15144f\Desktop\WGU_DataAnalyst_NanoDegree\02 - Data Wrangling with MongoDB'

Function:

In [2]:
def return_sql_query_as_dataframe(sql_query):
    #Connect to SQL DB
    connection = sq.connect(os.path.join(filepath, 'MapData.db'))
    cursor = connection.cursor()
    
    #Send user query to Cursor
    query = sql_query
    cursor.execute(query)
    
    #Fetch results and return a Pandas DF
    result = cursor.fetchall()
    names = [description[0] for description in cursor.description]
    return(pd.DataFrame(result, columns=names))

#### Files and File Sizes
List files sizes for .OSM XML files and output .CSV files

In [3]:
for root, dirs, files in os.walk(filepath):  
    for fn in files:
        if re.search('\.[csv|.osm]', fn):
            path = os.path.join(root, fn)
            size = os.stat(path).st_size # in bytes
            print(fn,"--", "{}KB".format(str(round(float(size/1024), 1))))

Cleaned_Henderson.osm -- 76697.4KB
henderson.osm -- 74871.6KB
nodes.csv -- 31376.1KB
nodes_tags.csv -- 557.8KB
ways.csv -- 2313.8KB
ways_nodes.csv -- 10428.6KB
ways_tags.csv -- 3538.6KB

#### Number of Unique Users

In [4]:
query = '''select count(distinct b.user) as "Distinct Users in Both Tables" 
from (
select user from nodes 
union 
select user from ways)b;'''
return_sql_query_as_dataframe(query)

   Distinct Users in Both Tables
0                            394

#### Number of Nodes in Dataset

In [5]:
return_sql_query_as_dataframe('select count(*) as "Number of Nodes in Dataset" from nodes;')

   Number of Nodes in Dataset
0                      353779

#### Number of Ways in Dataset

In [6]:
return_sql_query_as_dataframe('select count(*) as "Number of Ways in Dataset" from ways;')

   Number of Ways in Dataset
0                      35264

#### Retrieve Number of Chosen Type of Node (Power Towers)

Look at sample head of DataFrame returned containing power towers

In [17]:
query = '''select * from nodes n
inner join nodes_tags nt on nt.id = n.id
where nt.key = 'power'
limit 10000;'''
return_sql_query_as_dataframe(query).head()

,id,lat,lon,user,uid,version,changeset,timestamp,id,key,value,type
0,54315452,35.311169,-116.247819,Chris Bell in California,194231,4,5929701,2010-10-01T17:14:39Z,54315452,power,tower,tag
1,54315453,35.331677,-116.226027,Chris Bell in California,194231,3,5929701,2010-10-01T17:14:53Z,54315453,power,tower,tag
2,54315455,35.359924,-116.178285,Chris Bell in California,194231,3,5929701,2010-10-01T17:14:35Z,54315455,power,tower,tag
3,54315457,35.362457,-116.173913,Chris Bell in California,194231,3,5929701,2010-10-01T17:13:35Z,54315457,power,tower,tag
4,54315458,35.364977,-116.169689,Chris Bell in California,194231,3,5929701,2010-10-01T17:14:52Z,54315458,power,tower,tag

Now count the number of power towers in Nodes dataset

In [14]:
query = '''select count(*) as 'Number of Power Towers' from nodes n
inner join nodes_tags nt on nt.id = n.id
where nt.key = 'power'
limit 10000;'''
return_sql_query_as_dataframe(query).head()

   Number of Power Towers
0                    3675

<a name='#improvements'></a>
### Improvements/Suggestions for Dataset